# CurveArrArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveArrArrayIterator Class
Members See Also
---
An iterator to a array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CurveArrArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class CurveArrArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class CurveArrArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CurveArrArrayIterator
# See Also
CurveArrArrayIterator Members
Autodesk.Revit.DB Namespace